app/views/blogs/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
                <% if blog.user_id != nil %>
                    <%= User.find(blog.user_id).email %>

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
            <div class="row">
                <% if current_user.email == User.find(blog.user_id).email %>